app/controllers/monsters_controller.rb

SELECT "monsters".* FROM "monsters"
---
    def index
        monsters = Monster.all

SELECT  "monsters".* FROM "monsters" WHERE "monsters"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        monster = Monster.find(params[:id])

INSERT INTO "monsters" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Catnap"], ["description", "A Sleepy Cat"], ["user_id", 1], ["created_at", "2018-12-15 18:08:32.015582"], ["updated_at", "2018-12-15 18:08:32.015582"]]
---
    def create
        monster = Monster.new(monster_params)
        monster.user = current_user
        if monster.save